[{"title": "FBI notified Twitter of at least 1 Chinese agent working at the firm: Whistleblower", "content": "Former Twitter executive-turned-whistleblower Peiter Zatko has stated that Federal Bureau of Investigation (FBI) had notified Twitter of at least one Chinese agent working at the firm, Senator Chuck Grassley said. Zatko added that some Twitter employees were concerned that Chinese government would be able to collect data on some Twitter users. Zatko used to work as Twitter's head of security.", "category": "business"}, {"title": "Vedanta, Foxconn to invest ₹1,54,000 cr in Guj for semiconductor plant", "content": "Vedanta and Taiwan's Foxconn have signed a Memorandum of Understanding (MoU) with the Gujarat government to invest ₹1,54,000 crore for setting up a display fabrication and semiconductor facility in the state. Gujarat Chief Minister Bhupendra Patel said that the facility will create one lakh job opportunities. Foxconn is acting as the technical partner, while Vedanta will be financing the project.", "category": "business"}, {"title": "US inflation eases to 8.3% in August; falls for second straight month", "content": "The US' consumer price index (CPI) rose 8.3% in August 2022, data released by the US Bureau of Labor Statistics showed. It is down from 8.5% recorded in July and 9.1% reported in June, which was a 40-year high. Increases in the shelter, food and medical care indices were the largest contributors to the rise in US' CPI.", "category": "business"}, {"title": "NYT offers lunch boxes as return to work perk, staff says 'we want fair contracts' ", "content": "The New York Times offered its staff branded lunch boxes as a return-to-office perk as hundreds of them protested against the move, demanding fair contracts instead. An employee, while sharing the lunch box's photo, wrote, \"My colleagues and I don't need cute trinkets. 330 of us wrote emails...asking for real raises to combat inflation….What we need is a contract.\" ", "category": "business"}, {"title": "US firm offers 10% hike to staff on notice period, Founder says, 'no hard feelings'", "content": "A marketing firm in the US offers its employees a 10% hike if they agree to serve at least six weeks’ notice period. Gorilla's Founder Jon Franko wrote on LinkedIn, \"And we promise, no hard feelings. This encourages our people to do something different if they're feeling stuck...It also gives us time to prepare for how we'll move forward.\"\n", "category": "business"}, {"title": "Mensa Brands acquires peanut butter brand MyFitness", "content": "Mensa Brands acquired peanut butter brand, MyFitness for an undisclosed amount. MyFitness was founded by Mohammad Patel and Rahil Virani in 2019 and has over 30 stock-keeping units with an average selling price of ₹500. Mensa was founded by Ananth Narayanan, former CEO of Myntra and Medlife. Accel Partners, Falcon Edge Capital and Tiger Global Management are among its investors.\n", "category": "business"}, {"title": "JSW Steel partners with German firm to cut carbon emission, to invest $1.3 bn", "content": "JSW Steel has signed an agreement with Germany-based engineering and technology company SMS group to explore solutions to cut down carbon emissions at its plants. JSW Steel will reportedly invest around $1.3 billion for the same. It targets to bring down GHG emissions by 42% to less than 1.95 tonnes of carbon dioxide per tonne of crude steel by 2030.", "category": "business"}, {"title": "AP gets ₹40,361 cr-industrial investments between Jan-Jul: Report", "content": "Andhra Pradesh has topped the list of states in attracting industrial investments in the first seven months of 2022, a report by DPIIT stated. Of the total investment of ₹1,71,285 crore that the entire country received between January-July 2022, Andhra Pradesh got the investment of ₹40,361 crore. Reportedly, Andhra and Odisha combined have bagged 45% of the total investment. ", "category": "business"}, {"title": "Global firms looking to shift manufacturing operations from China to India: FM", "content": "Finance Minister Nirmala Sitharaman said global companies are looking to move out from China and set up their operations in India as they believe in India's growth story. Government will do everything to create an ecosystem for the industry to invest in India, Sitharaman added. Policies like PLI and tax cuts have been provided to India's private industry, she added.", "category": "business"}, {"title": "Amazon Wholesale reports loss of ₹480 cr in FY22, revenue up 47%", "content": "Amazon's B2B arm, Amazon Wholesale (India), reported a net loss of ₹480 crore in FY22 as against a net profit of ₹43 crore in FY21. Its revenue surged by 47% to ₹4,605 crore in FY22 and its total expenses were ₹5,086 crore. Its operating revenue rose by 46.6% to ₹4,592 crore from ₹3,131.9 crore on a year-on-year basis.", "category": "business"}, {"title": "2 Co-founders of US-based firm Peloton to step down amid restructuring ", "content": "John Foley and Hisao Kushi, Co-founders of New York-based Peloton Interactive Inc, will step down from executive roles. Company's board member, Karen Boone, will replace Foley while former Uber Technologies Inc executive, Tammy Albarran, will succeed Kushi. The firm that makes fitness equipment decided to cut jobs, hike prices and list its products on Amazon since it started incurring losses.", "category": "business"}, {"title": "Bajaj Holdings announces interim dividend of ₹110 per equity share", "content": "Bajaj Holdings & Investment Ltd has said that its board has approved an interim dividend of ₹110 per equity share of the face value of ₹10 for the financial year ending March 31, 2023. \"The record date for the purpose of determining the members eligible to receive the interim dividend has been fixed as Friday, September 23, 2022,\" it added.", "category": "business"}, {"title": "RBI may hike interest rates by 50 bps as inflation rises: Analysts", "content": "RBI may increase interest rates by another 50 basis points in September, analysts said. This comes after data showed that the country's retail inflation rose to 7.0% in August from 6.71% in July. \"[Another] month of above-target inflation clears...path for further monetary tightening at the next MPC (Monetary Policy Committee) meeting,\" said Rahul Bajoria, chief India economist at Barclays Bank.", "category": "business"}, {"title": "Inflation not a 'red-letter priority' for FM Sitharaman: Chidambaram", "content": "Congress leader P Chidambaram on Tuesday criticised Finance Minister Nirmala Sitharaman over the rise of the inflation rate to 7% in August. Chidambaram said, \"Only a few days ago, the Honourable FM said...inflation wasn't a 'red-lettered priority' for her.\" \"If [Sitharaman] doesn't see 'red' even now, we can...conclude that she doesn't represent the average family in India,\" Chidambaram added.", "category": "business"}, {"title": "Govt sets up panel to suggest ways to scale up VC/PE investments", "content": "The government has set up an expert committee to suggest ways for scaling up venture capital and private equity (VC/PE) investments, a circular issued by Finance Ministry said. The panel will \"comprehensively study the end-to-end frictions and potential accelerants from regulatory policy and taxation to facilitate ease of investing\", it said. SEBI's former Chairman M Damodaran will head the panel.", "category": "business"}, {"title": "Vedanta-Foxconn to make Atmanirbhar Silicon Valley a reality: Agarwal", "content": "Vedanta Chairman Anil Agarwal took to Twitter and said, \"Vedanta's landmark investment of ₹1.54 lakh crore will help make India's Atmanirbhar Silicon Valley a reality.\" He also said the Vedanta-Foxconn joint venture will \"reduce our electronics imports and provide 1 lakh direct skilled jobs to our people\". Foxconn will be the technical partner, while Vedanta will finance the project.\n", "category": "business"}, {"title": "SEBI has no role in new-age tech firms' IPO pricing: SEBI Chief", "content": "Referring to the pricing of the initial share sale of new-age technology companies, SEBI Chairperson Madhabi Puri Buch said, \"Our view is simple at what price you chose to do your IPO is your business, we have no business to suggest otherwise.\" She added, \"The days of the Controller of Capital Issue are long gone.\"", "category": "business"}, {"title": "India not defending Rupee, it can take care of itself: CEA Nageswaran", "content": "Chief Economic Advisor (CEA) V Anantha Nageswaran said India isn't defending the Rupee and that the currency \"can take care of itself\". \"I don't think Indian fundamentals are such that we need to defend the Rupee,\" Nageswaran added. \"RBI is making sure that whatever direction the Rupee is moving in line with the market trends is just gradual,\" he said.", "category": "business"}, {"title": "Rupee rises to 79.29 against US dollar, biggest jump in 3 weeks", "content": "The rupee registered its biggest jump in three weeks on Tuesday by gaining 23 paise to 79.29 against the US dollar from Monday's close of 79.52. The strengthening of the rupee was supported by a fall in global crude oil prices and also the American currency. The dollar index was last down by 0.2% at 107.9.\n", "category": "business"}, {"title": "UK unemployment rate falls to 48-year low as people quit labour market", "content": "Britain's unemployment rate fell to 3.6% in the May-July period as more people left the labour market, official figures showed. This is the lowest it has been since 1974. The number of people in employment grew by 40,000 in the three months, the Office for National Statistics said. The economic inactivity rate increased by 0.4 percentage points to 21.7%.\n", "category": "business"}, {"title": "Like Hanuman, you don't believe in your capacity: FM to India Inc", "content": "Referring to India Inc, Finance Minister Nirmala Sitharaman asked what was preventing them from entering the manufacturing sector even as other countries are showing confidence in India. \"Is it like Hanuman that you don't believe in your own capacity and strength,\" she asked, adding that the government was ready to hear the industry and act on what is presented. \n", "category": "business"}, {"title": "Lufthansa raises pilots' salary, enters truce period with union", "content": "German airline Lufthansa has agreed to increase the pay of the pilots by €980 after the frequent strike calls from them. Lufthansa and the German pilots' union, Vereinigung Cockpit have also entered a truce period, which will run until June 30, 2023, during which there will be no strikes. The agreement is subject to approval by responsible bodies, Lufthansa said.\n", "category": "business"}, {"title": "CCI rejects complaints against PVR-INOX proposed deal", "content": "The Competition Commission of India (CCI) rejected a complaint against the proposed merger of PVR and INOX Leisure. The CCI said that apprehension of the likelihood of the anti-competitive practices cannot be subjected to inquiry. A complaint was filed by non-profit group CUTS stating that the proposed deal will have anti-competitive effects on the industry and demanded a detailed probe. ", "category": "business"}, {"title": "Bharti Telecom plans to raise ₹6,000 cr of debt via NCDs: Report", "content": "Bharti Airtel promoter Bharti Telecom is planning to raise ₹6,000 crore in debt through non-convertible debentures (NCDs) to buy the remaining 3.33% stake in Airtel sold by Singapore Telecommunications (Singtel), as per a report. Last week, Singtel sold 1.76% in Airtel, of which Bharti Telecom acquired 1.62%. The NCDs are expected to have between one and three-year maturities.", "category": "business"}, {"title": "PharmEasy parent may raise $250 mn from private equity firms: Report", "content": "General Atlantic (GA), Canada Pension Plan Investment Board (CPPIB) and Abu Dhabi Investment Authority (ADIA) are considering investing about $250 million in PharmEasy's parent company API Holdings, as per a report. Existing investors like Temasek and ADQ will invest about $70-80 million through a convertible instrument. Bank of America and Morgan Stanley are its advisors for the fundraise.", "category": "business"}, {"title": "Saw evidence of my wife cheating on me, couldn't sleep anymore: Ex-Italy footballer Totti", "content": "Talking about separating from his wife Ilary Blasi in July this year, World Cup-winning former Italy footballer Francesco Totti said that he couldn't sleep after seeing evidence of Blasi cheating on him on her mobile phone. He added, \"That led to depression. I couldn't sleep anymore. I pretended nothing was wrong, but I was no longer me...I was someone else.\"", "category": "sports"}, {"title": "How does the World Test Championship points table read after England's series win vs SA?", "content": "Following their 2-1 series win against South Africa, England are placed seventh on the World Test Championship (WTC) points table with 38.6% of points won. South Africa are second with 60% of points won. Defending champions New Zealand are lying eighth on the table with 25.93% of points won, while India are fourth with 52.08% of points won.", "category": "sports"}, {"title": "Diego Costa joins PL club Wolves, video of announcement with real wolves goes viral", "content": "Former Chelsea and Atlético Madrid forward Diego Costa has joined Premier League club Wolverhampton Wanderers (Wolves), with the club releasing an announcement video of the footballer with real wolves. Talking about the viral video, the 33-year-old footballer said, \"I was scared to death. Holding that chain I kept thinking, 'What if this wolf thinks about jumping on top of me?'\"", "category": "sports"}, {"title": "There's more to it: Warner on captaincy ban not just being a result of sandpaper scandal", "content": "Australia opener David Warner has claimed that the lifetime captaincy ban imposed on him by Cricket Australia is not just a result of the 2018 sandpaper scandal. He stated that there was \"more to it\", including 2017’s dispute between players and CA over a new MOU. As per reports, Warner and Cricket Australia would discuss overturning his captaincy ban.", "category": "sports"}, {"title": "Who are the top 10 men's tennis players as latest rankings released?", "content": "US Open 2022 winner Carlos Alcaraz, aged 19, has become the youngest male tennis player to become world number one. US Open 2022 runner-up Casper Ruud has jumped to the second position, while Daniil Medvedev has slipped three spots to the fourth position. Rafael Nadal remains at the third position, while Novak Djokovic dropped one spot to be ranked 7th.", "category": "sports"}, {"title": "How can you already decide he'll go for runs: Gavaskar to fan over Harshal's selection", "content": "During a question-answer session conducted by 'Sports Tak', a fan questioned Harshal Patel's selection in India's T20 World Cup squad, saying he would go for runs as he bowls slow. Sunil Gavaskar responded, \"We will see that once the tournament starts. How can you already decide that he will go for runs? Let the match happen first.\"", "category": "sports"}, {"title": "Cong leader upset over exclusion of Shami, Siraj from India's T20 WC squad", "content": "Congress leader Tauseef Alam expressed his disappointment with the exclusion of Mohammad Shami and Mohammed Siraj from India's recently announced T20 World Cup squad. He has alleged that the team selection process wasn't fair and has said that he won't watch cricket until there is a fair selection in the Indian team. ", "category": "sports"}, {"title": "PSG looking to extend Lionel Messi's contract by 2 more years: Report", "content": "Ligue 1 club PSG are reportedly looking to extend Lionel Messi's contract by two more years as his current agreement expires next year. A report says fresh talks are unlikely to happen until after the 2022 FIFA World Cup. Messi has scored four goals and has made seven assists in nine games this season.", "category": "sports"}, {"title": "Opening innings is where we could see best of Pant in T20 cricket: Jaffer", "content": "Talking about Rishabh Pant's batting position in T20 cricket, Wasim Jaffer said he thinks that opening the innings is where everyone can see the best of the Indian wicketkeeper-batter. \"Provided Rohit is ok to bat at four,\" he added. Jaffer named KL Rahul, Rishabh Pant, Virat Kohli, Rohit Sharma and Suryakumar Yadav as his top five in India's T20I squad.", "category": "sports"}, {"title": "Arshdeep messaged me he isn't bothered about trolls: Childhood coach Rai", "content": "Commenting on trolling and criticism faced by India pacer Arshdeep Singh after he dropped a catch against Pakistan in Asia Cup 2022, his childhood coach Jaswant Rai said, \"He also sent me a message that he is not bothered.\" He added, \"He was, in fact, upset because he conceded a boundary versus Pakistan. He was dejected because of that boundary.\"", "category": "sports"}, {"title": "May miss Shami's pace at some stage of T20 WC: Ex-chief selector Prasad", "content": "Former BCCI chief selector MSK Prasad said the squad for the T20 World Cup 2022 seems balanced but may miss Mohammad Shami's pace at some stage. He added that post the tournament, players like Sanju Samson, Ravi Bishnoi and Ishan Kishan may get more chances. He also backed Rohit Sharma, KL Rahul and Virat Kohli for the top-three batting slots. ", "category": "sports"}, {"title": "Congratulations of Nadal is always special: Alcaraz after winning US Open", "content": "Reacting to Rafael Nadal's congratulatory message following his maiden Grand Slam win at US Open 2022, fellow Spaniard Carlos Alcaraz said, \"The congratulations of Rafael Nadal is always special.\" Earlier, Nadal tweeted, \"Congratulations Alcaraz for your first Grand Slam and for the number 1 [spot].\" The 19-year-old became the youngest world number one in men's tennis after winning US Open.", "category": "sports"}, {"title": "Need to find a way to play more Test cricket: Mark Boucher", "content": "South Africa's head coach Mark Boucher said that the \"heads\" of cricket \"need to find a way\" to play more Test cricket. \"It's exciting, especially with the way the games are being played now,\" Boucher said. He added, \"I'm a purist. I love test cricket to bits...To lose sight of test cricket and lose games is not great.\"", "category": "sports"}, {"title": "Punjab govt to give monthly stipend to sportspersons", "content": "Punjab Sports Minister Gurmeet Singh Meet Hayer launched the Olympian Balbir Singh Senior Scholarship Scheme, which aims to give a monthly stipend to sportspersons who bag the first three positions in national competitions. The scheme provides a monthly stipend of ₹8,000 for one year to senior national medal winners while the junior national medal winners will get ₹6,000. ", "category": "sports"}, {"title": "Kohli is great option as opener for India in T20Is: Rohan Gavaskar", "content": "Former Indian cricketer Rohan Gavaskar said that batter Virat Kohli is a \"great option\" as an opener for India in T20Is. \"You look at his (Kohli) T20 numbers, they are outstanding. He averages about 55-57 and his strike rate is about 160,\" Rohan said. He added, \"His last innings, again unbeaten innings of 122, tells you that he...relishes opening.\"", "category": "sports"}, {"title": "She's showing off her growth in greatness: Roddick on world no. 1 Swiatek", "content": "Andy Roddick praised Iga Swiatek following her US Open win, saying the world number one is showing off her growth in greatness. \"Conditions/balls she wasn't a massive fan of...not having had her best stuff coming into this Slam. Still problem solved,\" he added. Swiatek has won seven titles in 2022, the most by a woman since Serena Williams in 2014.", "category": "sports"}, {"title": "It's tricky but I want Suryakumar at number 3: Rohan Gavaskar", "content": "Former Indian cricketer Rohan Gavaskar has commented on the Indian T20I team's batting order for games in the upcoming ICC T20 World Cup in Australia. \"Suryakumar Yadav at number three [is] a pleasing thought. But Virat...showed what a tremendous success he is as an opener. It means KL Rahul will have to make way...It's one of those tricky...situations,\" Rohan said.", "category": "sports"}, {"title": "Ronaldo is the greatest of all time: Zidane on choice between Messi, Ronaldo ", "content": "On being asked to pick between Cristiano Ronaldo and Lionel Messi, Zidane said, \"Cristiano is the best. Messi is his rival and it's the rivalry everyone wants to see.\" He added, \"But Ronaldo is phenomenal. There are no words to describe him. He's much better than me even though I had a great career. He's the greatest of all time.\"", "category": "sports"}, {"title": "I don't think it's realistic to lead Aus in 3 formats: Pat Cummins", "content": "Australian Test skipper Pat Cummins said that he doesn't think it's \"realistic\" to lead the country in all three formats. \"Especially as a fast bowler, I think you do need to find windows to rest...I am really happy with captaining the Test side,\" Cummins said. Notably, the last Australian ODI skipper, Aaron Finch, retired from the format on Sunday. ", "category": "sports"}, {"title": "To be in same sentence as Arthur Ashe in anything is unbelievable: Tiafoe", "content": "World number 19 Frances Tiafoe, who became the first Black American man to reach the semi-final of US Open since Arthur Ashe in 1972, said, \"To be in the same sentence as Arthur Ashe in anything is unbelievable.\" \"And that's something no one can ever take from me so I'm gonna remember that forever,\" he added. Tiafoe lost in semi-final.", "category": "sports"}, {"title": "Amazing performance: Djokovic on Alcaraz's 1st-ever Grand Slam win", "content": "Novak Djokovic took to Instagram Stories to congratulate 19-year-old Carlos Alcaraz following his maiden Grand Slam win at US Open 2022 and wrote, \"Amazing performance.\" \"Congratulations also to Casper Ruud for the fantastic season he is having,\" he added. Alcaraz beat Ruud 6-4, 2-6, 7-6(7-1), 6-3 in the final. The Norwegian lost in his second straight Grand Slam final.", "category": "sports"}, {"title": "I go for Roger: Müller on choosing between Federer and Nadal", "content": "When asked to choose between Roger Federer and Rafael Nadal, FC Bayern Munich forward Thomas Müller said, \"I go for Roger.\" Federer, who hasn't played since his quarter-final loss at Wimbledon 2021, has won 20 Grand Slams so far. Nadal took his Grand Slam tally to 22 after winning the Australian Open and French Open this year. ", "category": "sports"}, {"title": "Any opportunity to captain Aus would be a privilege: Warner", "content": "After the Australian ODI skipper Aaron Finch recently retired from the format, Australian batter David Warner said that \"any opportunity to captain would be a privilege\". \"I haven't had any conversations at all...But...there's a lot of water to go under the bridge, to have those conversations with Cricket Australia and my main focus is just actually playing cricket,\" Warner said.", "category": "sports"}, {"title": "Entire team gave their best, we made it: SL skipper Shanaka on Asia Cup win", "content": "Praising Sri Lanka following their Asia Cup win, skipper Dasun Shanaka said, \"Entire team gave it their best and we made it!\" Sri Lanka defeated Pakistan by 23 runs in final to clinch their first title since 2014. They won five matches in a row after losing to Afghanistan in their first match. Overall, it was Sri Lanka's sixth title.", "category": "sports"}, {"title": "I was lucky Djokovic couldn't play: Alcaraz on his 1st Grand Slam at US Open", "content": "Following his maiden Grand Slam win at US Open 2022, world number one Carlos Alcaraz said he was lucky that 21-time Grand Slam champion Novak Djokovic couldn't participate in the last Grand Slam of the season. The unvaccinated Serbian was denied entry to the US owing to vaccination protocols. \"I don't want to take credit away from myself,\" he added.", "category": "sports"}, {"title": "Twitter shareholders approve Elon Musk's $44-billion bid to buy company", "content": "Twitter shareholders on Tuesday approved Elon Musk’s $44-billion bid to buy the social media platform. Twitter said that the measure passed based on a preliminary count, adding that it will provide a final vote count to shareholders at a later date. Musk in July announced that he was calling off his bid to buy the firm.", "category": "technology"}, {"title": "Majority Twitter shareholders vote in favour of sale to Musk: Report", "content": "A majority of Twitter shareholders reportedly voted in favour of the company's $44 billion sale to Tesla CEO Elon Musk. Shareholders were expected to vote in favour after Twitter's stock price went from $54.20 apiece in April to around $41 apiece currently. Twitter and Musk will go to trial in October to resolve his attempt to cancel the acquisition deal. ", "category": "technology"}, {"title": "Woman dies after Redmi 6A explodes at night; YouTuber shares pics of damaged phone", "content": "A YouTuber from Haryana has claimed that his aunt died after Xiaomi's Redmi 6A smartphone exploded while she was sleeping at night. \"She kept the phone near her face on pillow side and after sometime her phone [exploded],\" Manjeet said. Xiaomi said it is trying to get in touch with the affected family and determine the cause of the incident.", "category": "technology"}, {"title": "Blue Origin's uncrewed rocket crashes to Earth a minute after launch, video surfaces", "content": "A Blue Origin rocket crashed back to Earth just a minute after it was launched on Monday, marking the first launch failure for the Jeff Bezos-led space travel company. While the uncrewed capsule parachuted back to Earth after its abort system kicked in, the rocket came crashing down. \"It appears we've experienced an anomaly...This wasn't planned,\" the launch commentary announced.   ", "category": "technology"}, {"title": "Vedanta, Foxconn to invest ₹1,54,000 cr in Guj for semiconductor plant", "content": "Vedanta and Taiwan's Foxconn have signed a Memorandum of Understanding (MoU) with the Gujarat government to invest ₹1,54,000 crore for setting up a display fabrication and semiconductor facility in the state. Gujarat Chief Minister Bhupendra Patel said that the facility will create one lakh job opportunities. Foxconn is acting as the technical partner, while Vedanta will be financing the project.", "category": "technology"}, {"title": "2,800-kg maglev car that floats above highway tested in China, video surfaces", "content": "A car equipped with magnetic levitation (maglev) technology was recently successfully tested on a highway in China. The 2,800-kg vehicle 'floated' 35 millimetres above the road surface, powered by electromagnetic force and guided by pre-installed conducting rails. China had unveiled the first maglev train in Shanghai in 2004.", "category": "technology"}, {"title": "HCL fires 350 employees globally who were working on Microsoft project: Report", "content": "HCL Technologies fired 350 employees globally who were working on its client Microsoft’s news-related products, as per a report. The employees were informed about this during a town hall last week. As per the report, these employees will be offered severance pay and were laid off from geographies including India, Guatemala and the Philippines, among others. \n", "category": "technology"}, {"title": "Infosys warns staff against moonlighting, says 'No two-timing, no double lives': Report", "content": "Infosys has warned employees against dual employment or 'moonlighting', stating that any violation will lead to disciplinary action, including termination of employment, the Times of India reported. With the taglines 'No two-timing, no moonlighting' and 'No double lives', Infosys told employees they cannot take up other assignments during or outside business hours without seeking its consent.   ", "category": "technology"}, {"title": "FBI notified Twitter of at least 1 Chinese agent working at the firm: Whistleblower", "content": "Former Twitter executive-turned-whistleblower Peiter Zatko has stated that Federal Bureau of Investigation (FBI) had notified Twitter of at least one Chinese agent working at the firm, Senator Chuck Grassley said. Zatko added that some Twitter employees were concerned that Chinese government would be able to collect data on some Twitter users. Zatko used to work as Twitter's head of security.", "category": "technology"}, {"title": "$7.75 million payment to whistleblower didn't breach deal with Musk: Twitter", "content": "Responding to Tesla CEO Elon Musk, Twitter has said that the $7.75 million payment made to a whistleblower didn't breach any conditions of its $44 billion buyout agreement with Musk. Musk’s lawyers had earlier said that Twitter's failure to seek Musk’s consent for Peiter Zatko's payment violated the merger agreement, thereby stating it as another reason to end the deal.\n", "category": "technology"}, {"title": "Tesla sees three more executives depart months after India plan put on hold: Report", "content": "Tesla has seen three of its executives from the original 12-member India team depart in the last three months, Economic Times reported. The exits come after its Policy and Business Development executive Manuj Khurana resigned in June. While earlier reports said Tesla has put its India plan on hold, the company is yet to to give up its Bengaluru office.", "category": "technology"}, {"title": "BMC introduces 'Bluetooth enabled' stethoscopes in 2 Mumbai hospitals", "content": "The BMC, with the help of a start-up, has introduced 'Bluetooth enabled' stethoscopes in two civic-run major hospitals, Sion and BYL Nair Hospitals. The digital stethoscope, AyuSynk, will detect remote auscultation (listening to chest sounds). This will allow doctors to maintain a safe distance in the case of infectious diseases, said Dr Neelam Andrade, the director of major civic hospitals.", "category": "technology"}, {"title": "WhatsApp may soon allow users to search messages by date: Report", "content": "WhatsApp is working on a feature that will allow users to search for a message by date, WABetaInfo reported. A 'calendar' icon will reportedly appear when a user searches for a message in a conversation. Upon clicking it, the user will be able to jump to a certain date and read all messages in the conversation received on that date.", "category": "technology"}, {"title": "Apple rolls out watchOS 9 with Medications app, AFib History feature", "content": "Apple has started rolling out the latest watchOS 9 with an all-new Medications app and an AFib History feature. The new watchOS also includes four new faces - Lunar, Playtime, Metropolitan and Astronomy. The Workout app has also been updated to support a new Multisport workout type that automatically switches between any sequence of swimming, biking and running workouts. ", "category": "technology"}, {"title": "It annoyed me: Dogecoin co-creator on Musk sending Doge-1 to the Moon", "content": "Dogecoin co-creator Jackson Palmer said he was \"kind of annoyed\" when billionaire Elon Musk attempted to send a crypto-themed satellite called Doge 1 \"to the Moon\" last year. Palmer said he's grown tired of being \"dragged\" into conversations about Dogecoin. \"Even when I had completely deleted all social media, [conversations about Dogecoin] continued to follow me,\" he added.", "category": "technology"}, {"title": "MeitY Startup Hub & Meta collaborate to accelerate XR tech startups", "content": "MeitY Startup Hub, an initiative of the Ministry of Electronics and IT, will collaborate with Facebook's parent company, Meta, to accelerate and support XR (Extended Reality) technology startups in India. In a statement, the Ministry said, \"This collaboration is part of the government's efforts for skilling in emerging and future technologies.\" The programme will be launched on September 13. ", "category": "technology"}, {"title": "Ethereum blockchain may be upgraded this week to cut energy use by 99.9%: Report", "content": "Ethereum blockchain is expected to undergo a software upgrade this week to allow it to consume 99.95% lesser energy than it currently does to create ether tokens, Reuters reported. The Ethereum Foundation said the upgrade, known as 'The Merge', will take place between September 10-20. The upgrade may widen the technology's use and support ether token's price.", "category": "technology"}, {"title": "After Apple, Google plans to make Pixel phones in India: Report", "content": "Amid supply disruptions due to COVID-19 restrictions in China, Google is planning to shift some production of Pixel phones to India, a report said. Google has reportedly asked Indian manufacturers to submit bids for the assembly of five lakh-ten lakh units of its Pixel smartphones. Earlier, a report said that Apple is planning to begin manufacturing iPhone 14 in India.", "category": "technology"}, {"title": "Nintendo shares surge 5% after record launch sales of 'Splatoon 3'", "content": "Shares of Nintendo surged 5% on Tuesday after the gaming company reported domestic launch sales of over 3.45 million units for its shooter \"Splatoon 3\" on the Switch console. \"Splatoon 3\", which was launched on September 9, exceeded the sales of \"Animal Crossing: New Horizons\" and \"Super Smash Bros. Ultimate\", which respectively sold 39.4 million and 28.8 million units globally.\n", "category": "technology"}, {"title": "Google faces $25.4 bn damages lawsuit over anti-competitive adtech practices", "content": "Google is facing a $25.4 billion damages claim lawsuit in the UK and EU over its alleged anti-competitive practices in the digital advertising industry. Publishers have long been harmed by Google's anti-competitive conduct, an official of one of the law firms involved in the suits said. UK's competition watchdog is also investigating Google's power in the digital advertising technology market.", "category": "technology"}, {"title": "Still open to other partners: Ubisoft CEO over deal with Tencent", "content": "French video game maker Ubisoft is still open to other partners, CEO Yves Guillemot said after the company announced that Tencent will soon become Ubisoft's single biggest shareholder with an overall stake of 11%. The deal values Ubisoft at about $10 billion. \"We remain totally independent and we can act with any outside company if we want to,\" Guillemot said.", "category": "technology"}, {"title": "Google testing feature to reduce background noise during phone calls: Report", "content": "Google is testing the 'Clear Calling' feature to reduce background noise during calls on devices running on the Android 13 QPR1 Beta OS, according to reports. Sharing information about the feature, Twitter user Mishaal Rahman said it works \"for most mobile networks\" but is \"not available for Wi-Fi calling\". The feature doesn't send content from calls to Google, Rahman added.", "category": "technology"}, {"title": "Google Play Store’s new app review policy to bring more genuine reviews: Report", "content": "Google is reportedly bringing a new app review policy to make app ratings and reviews on Play Store more genuine. Under the policy, user-submitted reviews and ratings will be held up by around 24 hours before they go public. Google also warned against posting the same review multiple times as well as reviews for the same content from multiple accounts.", "category": "technology"}, {"title": "Inventor behind Amazon's Alexa raises $20 mn for new AI startup", "content": "The inventor of various technologies used by Amazon Inc's Alexa, William Tunstall-Pedoe, has raised $20 million for a new Artificial Intelligence (AI) startup called Unlikely AI. Amadeus Capital Partners, Octopus Ventures and former Google CFO Patrick Pichette, who is currently a Twitter board member, are backing the startup. Tunstall-Pedoe left Amazon in 2016 and was advising AI companies. ", "category": "technology"}, {"title": "Biden to widen curbs on exporting US chips, tools to China: Report", "content": "The Biden administration plans to widen curbs on shipment of US-made semiconductors to China used for artificial intelligence and chipmaking tools, sources told Reuters. The Commerce Department is looking to publish new rules communicated to three US firms in letters written earlier this year. The letters barred the firms from exporting chipmaking equipment to Chinese factories without licences.", "category": "technology"}, {"title": "Mumbai Police shares post on traffic safety with 'Brahmāstra' reference, Alia says 'Epic'", "content": "Mumbai Police shared a post to spread traffic awareness with a reference to 'Brahmāstra'. It did so by referencing the 'astras' (weapons) shown in the film to talk about traffic safety and wrote in the caption, \"'Junoon' & 'Raftar' can put your 'Universe' at risk. Driving safe is the biggest 'Astra' forever.\" Sharing the post, actress Alia Bhatt wrote, \"Epic.\"", "category": "entertainment"}, {"title": "Zendaya hides face as Emmy host jokes she is 'too old' to date DiCaprio, video viral", "content": "A video shows actress Zendaya, who recently turned 26, hiding her face as Emmy host Kenan Thompson joked she's \"too old\" to date Leonardo DiCaprio. \"Zendaya just turned 26. 26 is a weird age in Hollywood. Young enough to play...high school student, but too old to date Leonardo DiCaprio,\" Kenan joked. The crowd can be heard laughing at Kenan's joke.", "category": "entertainment"}, {"title": "Meghan hugs girl mourning Queen Elizabeth's death, video of exchange goes viral", "content": "A video has shown Meghan Markle hugging a girl who was among throngs of mourners waiting outside Windsor Castle after Queen Elizabeth's death. A now-viral clip posted on TikTok showed Meghan telling the girl, \"Thank you for being here, it means so much to the family. We appreciate it.\" Several fans have praised Meghan for the gesture.", "category": "entertainment"}, {"title": "'Breathless' director Jean-Luc Godard passes away at 91", "content": "Veteran filmmaker Jean-Luc Godard passed away at the age of 91 on Tuesday. Godard, who directed 'Breathless' and 'Alphaville', is known for his work in the French cinemas during the 1960s. French newspaper Liberation reported the filmmaker's death. His 1960 film 'Breathless' featured Jean-Paul Belmondo and Daniel Boulanger.", "category": "entertainment"}, {"title": "Priyanka cried after she was offered a negative role in 'Aitraaz': Suneel Darshan", "content": "Producer Suneel Darshan revealed that Priyanka Chopra had cried after she was offered a negative character in 'Aitraaz'. \"She was so upset, she cried, she went home and she went to sleep,\" he added. \"I said after you wake up come back to the office...I pressed on her...the importance of...doing the role,\" Suneel further said.", "category": "entertainment"}, {"title": "'Adipurush' makers to launch film's teaser on Oct 3 in Ayodhya: Report", "content": "The makers of 'Adipurush' will launch the teaser of the film at a \"grand on-ground event\" in Ayodhya on October 3, according to a report. Directed by Om Raut, the film will feature Prabhas as Lord Ram, Saif Ali Khan as Ravan and Kriti Sanon as Sita. 'Adipurush' will release in theatres on January 12, 2023. ", "category": "entertainment"}, {"title": "'Maarrich' has challenged me as an actor on many levels: Tusshar", "content": "Actor Tusshar Kapoor, speaking about his upcoming film 'Maarrich', has said that the film has challenged him as an actor on \"many levels\". \"It's very different from the work that I have been associated with earlier, I hope the audiences like this new shade of mine,\" he added. Tusshar has produced the film which also features Naseeruddin Shah.", "category": "entertainment"}, {"title": " Raj Kapoor was happy to see me in Indian attire when we met: Mandakini", "content": "Actress Mandakini revealed that actor Raj Kapoor was happy to see her in Indian attire when they first met. She further added, \"He said, 'Had you worn jeans or a t-shirt then I wouldn't have liked it at all'. He said he wanted somebody homely.\" Mandakini went on feature in Raj's last directorial film 'Ram Teri Ganga Maili'.", "category": "entertainment"}, {"title": "Firoz Nadiadwala to make 5D film on Mahabharat on budget of ₹700 cr: Report", "content": "Producer Firoz Nadiadwala is working on a film based on Mahabharat, according to reports. It'll reportedly be made on a budget of ₹700 crore and actors including Akshay Kumar, Ajay Devgn and Ranveer Singh are being considered to play pivotal roles in the film. \"Mahabharat will be...first Indian film to be shot in 5D,\" a source was quoted as saying. ", "category": "entertainment"}, {"title": "Ayushmann, Rakul's 'Doctor G' to release on Oct 14: Report", "content": "Ayushmann Khurrana and Rakul Preet Singh-starrer 'Doctor G' is set to release on October 14, according to a report. As per a source quoted by Pinkvilla, the date will enable the film to get a clear run of 11 days until the release of Akshay Kumar-starrer 'Ram Setu' and Ajay Devgn's 'Thank God'. 'Doctor G' also stars Shefali Shah.  \n", "category": "entertainment"}, {"title": "Alia Bhatt is the only person I feel competitive with: Varun Dhawan", "content": "Actor Varun Dhawan said Alia Bhatt is the only person he feels competitive with. \"With Alia Bhatt's smashing big openings, as a male actor, I seek inspiration from that and aspire to do it too as a performer,\" Varun added. He said the society needs to accept that \"our female leads can also be bigger than heroes\".", "category": "entertainment"}, {"title": "It's a democracy, it's fine: Swara on Kangana's 'B-grade actress' remark", "content": "Swara Bhasker in an interview spoke about her Twitter feud with Kangana Ranaut, which happened in 2020. \"Kangana Ji...called me and Taapsee (Pannu) B-grade actresses...I felt it was an invitation to talk,\" she said. Asked about her comments, Swara said, \"It's fine. It's a democracy, people have...right to say what they want...My logic is...if you're talking then I'll also talk.\"", "category": "entertainment"}, {"title": "Stranger Things-Deadpool crossover project is on the table, says Shawn Levy", "content": "Filmmaker Shawn Levy revealed that a crossover of 'Deadpool' and 'Stranger Things' is \"on the table\". \"Ryan Reynolds and I were trying to figure out how in the world could we do a...crossover. We haven't cracked it yet...but it's on the table,\" he said. Shawn produced 'Stranger Things' and will be directing the upcoming third instalment in the 'Deadpool' franchise. ", "category": "entertainment"}, {"title": "'Fabulous Lives...' isn't staged or scripted: Neelam Kothari", "content": "Actress Neelam Kothari has said that the new season of 'Fabulous Lives Of Bollywood Wives' isn't staged or scripted after some Twitter users alleged that the show seemed to be scripted. \"What comes out of the four of us cannot be staged or fabricated. If that were the case, then all...of us would need an Oscar,\" Neelam stated.", "category": "entertainment"}, {"title": "Not answerable to anybody: Nisha on 'extramarital affair' accusation", "content": "Actress Nisha Rawal has reacted after her estranged husband Karan Mehra accused her of having an extramarital affair with a man named Rohit Satia. She said that she's \"not answerable\" to anyone. \"After...breakup, what I do in my personal life, it's none of his business and what he does in his personal life is none of my business,\" Nisha added. ", "category": "entertainment"}, {"title": "The core of Vikram Vedha's story is inspired by Vikram Betaal: Makers", "content": "Director duo Pushkar and Gayatri, speaking about 'Vikram Vedha', said, \"The core of [the film's] story is inspired by the famous folklore of 'Vikram Betaal'.\" \"We were fascinated with the dynamics shared by Vikram Betaal and so when we started writing the story of our film, we adapted that nostalgia into the characters of Vikram & Vedha,\" they added.  ", "category": "entertainment"}, {"title": "Titles and credits are in Hindi now, it's a good move: Irshad Kamil", "content": "Speaking about the presence of Hindi in the film industry, lyricist Irshad Kamil has said that steps have been taken to improve the language's presence. \"Now film titles and credits are in Hindi too, which is a good move,\" he stated. Irshad added directors can create situations where only Hindi is used for lyrics and dialogues to improve things further.", "category": "entertainment"}, {"title": "Already thinking of origins story on SRK's Brahmastra character: Ayan", "content": "Filmmaker Ayan Mukerji has said that he is thinking of an origins story for Shah Rukh Khan's character in the film 'Brahmastra'. Shah Rukh, who played a scientist, had a cameo in the film. \"Before the fans were saying it, we were also saying that ourselves,\" Ayan stated. The first instalment of 'Brahmastra' featured Ranbir Kapoor and Alia Bhatt.", "category": "entertainment"}, {"title": "There was violent sex in 'Game of Thrones', it made me nervous: Emily", "content": "'House of the Dragon' actress Emily Carey said that there is a lot of violent sex in 'Game of Thrones' and revealed it made her nervous. \"I was like, 'Oh God, what am I gonna have to do in this show?',\" she added. Emily stated that the showrunners Ryan Condal and Miguel Sapochnik made the entire cast feel secure.", "category": "entertainment"}, {"title": "'Bhabi Ji...' actress Shubhangi approached for 'Bigg Boss 16': Reports", "content": "'Bhabi Ji Ghar Par Hai!' actress Shubhangi Atre has reportedly been approached for 'Bigg Boss 16'. According to reports, Madirakshi Mundle from 'Siya Ke Ram' is also in talks to be part of the Salman Khan-hosted show. Reportedly, Shilpa Shetty Kundra's businessman-husband Raj Kundra has also been approached for the show. The upcoming season will reportedly premiere in October. ", "category": "entertainment"}, {"title": "Shanaya to begin shooting for Bedhadak by end of 2022: Sanjay Kapoor", "content": "Actor Sanjay Kapoor has said that his daughter Shanaya Kapoor will begin shooting for 'Bedhadak' by the end of 2022. 'Bedhadak', which will be produced by Dharma Productions, will be Shanaya's debut film in Bollywood. Earlier, there were reports that the film had been shelved. 'Bedhadak' will also feature Laksh Lalwani and Gurfateh Pirzada.", "category": "entertainment"}, {"title": "Dulquer can be a terrific discovery for other half of country: Balki on Chup", "content": "Filmmaker R Balki opened up about casting Dulquer Salmaan in his upcoming thriller 'Chup'. He said, \"I was lucky to have someone super talented, a superstar in one half of the country, who speaks Hindi as if it's his mother tongue and who can be a terrific discovery for...other half of...country.\" Dulquer predominantly works in Malayalam and Tamil language films.  ", "category": "entertainment"}, {"title": "It was my mother's dream to see me on 'The Kapil Sharma Show': Gaurav Dubey", "content": "Comedian Gaurav Dubey, who plays a character named Roopmati on 'The Kapil Sharma Show', said in an interview that it was his mother's dream to see him on the show. He said Kapil Sharma is \"amazing\", adding that the 41-year-old actor-comedian teaches him \"like a Guru\". \"I've a feeling that I'll learn a lot from my stint in...show,\" said Gaurav.  ", "category": "entertainment"}, {"title": "I believed that we need such a story: Mrunal Thakur on 'Sita Ramam'", "content": "Actress Mrunal Thakur said she signed for 'Sita Ramam' in 2020 and added that people questioned her decision to sign a Telugu film after featuring in Bollywood films. \"People do Telugu films and then come to Bollywood. I believed in the story [of 'Sita Ramam'] and my character. I believed that we need such a story,\" she further stated.", "category": "entertainment"}, {"title": "It’s rubbish: R Balki on claims that Bollywood is finished ", "content": "Filmmaker R Balki said the claims that Bollywood is finished are \"rubbish\". Reacting to Hindi films' poor performance at the box office, Balki said Bollywood is going through a phase, which \"won't last for too long\". Giving an example of 'Brahmastra Part One: Shiva', he added, \"As you are already seeing, people are storming the theatres. So, it'll change.\"", "category": "entertainment"}]